# SystemClassification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData..::..SystemClassification Property
PipeFittingAndAccessoryData Class See Also
---
The system classification of the pipe fitting or pipe accessory.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MEPSystemClassification SystemClassification { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemClassification As MEPSystemClassification
	Get
```

Visual C++
---
```text
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
}
```

# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace